spec/vcr/currency_cloud/send_money.yml

---
http_interactions:
- request:
    method: post
    uri: https://coolpay.herokuapp.com/api/login
    body:
      encoding: UTF-8
      string: '{"username":"DariuszU","apikey":"63830AEF4DBFAD18"}'
    headers:
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Connection:
      - keep-alive
      Server:
      - Cowboy
      Date:
      - Sun, 25 Nov 2018 15:18:00 GMT
      Content-Length:
      - '48'
      Content-Type:
      - application/json; charset=utf-8
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000
      X-Request-Id:
      - f30ce22c-69f6-4454-a82e-f74c500c184f
      Via:
      - 1.1 vegur
    body:
      encoding: UTF-8
      string: '{"token":"d1734fca-ad29-46ee-b054-3a189a5afe8a"}'
    http_version: 
  recorded_at: Sun, 25 Nov 2018 15:18:00 GMT
- request:
    method: post
    uri: https://coolpay.herokuapp.com/api/payments
    body:
      encoding: UTF-8
      string: '{"payment":{"amount":10.22,"currency":"GBP","recipient_id":"7e559235-c05f-4c9c-9914-84c09173ca85"}}'
    headers:
      Content-Type:
      - application/json
      Authorization:
      - Bearer d1734fca-ad29-46ee-b054-3a189a5afe8a
  response:
    status:
      code: 201
      message: Created
    headers:
      Connection:
      - keep-alive
      Server:
      - Cowboy
      Date:
      - Sun, 25 Nov 2018 15:18:00 GMT
      Content-Length:
      - '167'
      Content-Type:
      - application/json; charset=utf-8
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000
      X-Request-Id:
      - ca61daf3-77bb-4984-83f4-219439bd7c07
      Location:
      - "/api/payments/31ba0157-6140-46df-9d48-71db841927f0"
      Via:
      - 1.1 vegur
    body:
      encoding: UTF-8
      string: '{"payment":{"status":"processing","recipient_id":"7e559235-c05f-4c9c-9914-84c09173ca85","id":"31ba0157-6140-46df-9d48-71db841927f0","currency":"GBP","amount":"10.22"}}'
    http_version: 
  recorded_at: Sun, 25 Nov 2018 15:18:01 GMT
recorded_with: VCR 4.0.0
