spec/vcr/currency_cloud/send_money_invalid_amount.yml

---
http_interactions:
- request:
    method: post
    uri: https://coolpay.herokuapp.com/api/login
    body:
      encoding: UTF-8
      string: '{"username":"DariuszU","apikey":"63830AEF4DBFAD18"}'
    headers:
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Connection:
      - keep-alive
      Server:
      - Cowboy
      Date:
      - Sun, 25 Nov 2018 15:15:17 GMT
      Content-Length:
      - '48'
      Content-Type:
      - application/json; charset=utf-8
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000
      X-Request-Id:
      - 2dbbee1a-3d25-4f52-94b9-564730bf7ea3
      Via:
      - 1.1 vegur
    body:
      encoding: UTF-8
      string: '{"token":"22de3178-484e-47c1-a177-8bfd9a409f71"}'
    http_version: 
  recorded_at: Sun, 25 Nov 2018 15:15:17 GMT
- request:
    method: post
    uri: https://coolpay.herokuapp.com/api/payments
    body:
      encoding: UTF-8
      string: '{"payment":{"amount":{"amount":10.22},"currency":"GBP","recipient_id":"7e559235-c05f-4c9c-9914-84c09173ca85"}}'
    headers:
      Content-Type:
      - application/json
      Authorization:
      - Bearer 22de3178-484e-47c1-a177-8bfd9a409f71
  response:
    status:
      code: 422
      message: Unprocessable Entity
    headers:
      Connection:
      - keep-alive
      Server:
      - Cowboy
      Date:
      - Sun, 25 Nov 2018 15:15:17 GMT
      Content-Length:
      - '36'
      Content-Type:
      - application/json; charset=utf-8
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000
      X-Request-Id:
      - eb2b38df-a650-4648-9ca2-6d5266168444
      Via:
      - 1.1 vegur
    body:
      encoding: UTF-8
      string: '{"errors":{"amount":["is invalid"]}}'
    http_version: 
  recorded_at: Sun, 25 Nov 2018 15:15:18 GMT
recorded_with: VCR 4.0.0
